const app_description =
'''
개발자의 편지
오리진에서 그래프 만들때 여러번 측정한 내부구조가 똑같은 실험 데이터를 시트를 한번에 넣으면 다 각각 시트별로 워크북이 하나씩 만들어지는데 그런거 말고 한 워크북에 몰아 넣고 싶은데 주위에 물어보니깐 그럴려면 하나하나 손으로 복붙 해야한다고 해서 나는 그거 귀찮아서 못해먹겠어서 하나 만들려고 보니 데이터 시트에서 필요한 부분만 가져와야해서 그 기능도 같이 만들었다. 만들고 나니깐 데이터 붙이기 너무 편하고 좋다. 사용방법은 'Drop files here' 부분에 이어붙일 파일들을 드래그 앤 드랍으로 올려 놓은다음 원하는 부분을 잘라서 합치면 된다. 합처진 파일은 이 어플리케이션이 있는 파일에 'result.csv' 라고 생긴다. 지금 이 글을 읽고 있는 부분에서 첫번째 파일만 미리보기를 할 수 있으며 자르는것도 미리 보기를 할 수 있다. 자를때는 데이터 자르기에서 자르면 되는데, 총 4개의 값을 입력해야하고 위에서부터 각각 위에서 얼마큼 자를 것인가 아래에서 얼마큼 자를것인가 왼쪽에서 얼만큼 자를 것인가 오른쪽에서 얼마큼 자를것인가 이다. 당연하겠지만 입력 값은 파일의 행,열의 최대값을 넘지 못하며 최댓값은 내가 친절하게 입력 부분에다가 써 넣어놨다. 버그 수정을 아직 완벽하게 하지 못했는데 생각보다 이상한 부분에서 버그가 많이 일어나서 고치는게 좀 귀찮은게 아니다. 그러므로 이것을 쓸때에는 버그가 안나가 알잘딱하게 사용하자.사용순서는 합치고 싶은 파일 올리고 자르고 합치면 된다. 그것 외에도 다른 기능이 필요하면 제작자 에게 기능을 요청하라 아마 귀찮아서 업데이트트 더 안할듯 쓰는 사람이 나 밖에 없을거 같지만 이게 써보면 생각보다 편해서 좋음. 넣을 수 있는 파일은 .txt .csv .xlsx 세가지만 가능
''';

const sponsor =
'''
제작자 후원
기업은행 130-088123-01-011
''';